Tekla.Structures.Model.ControlLine
The ControlLine class defines a user defined (possibly magnetic) line helping in modeling work.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
ControlLine controlLine = new ControlLine();
LineSegment line = new LineSegment();
line.Point1 = new Point(6000,6000,0);
line.Point2 = new Point(6000,12000,0);
controlLine.IsMagnetic = true;
bool Result = false;
Result = controlLine.Insert();
}
}